vhorvat/herbarium_STM32/X_NUCLEO_IKS01A3/Components/LIS2DW12/lis2dw12_reg.h
#define LIS2DW12_ALL_INT_SRC                 0x3BU
typedef struct {
    uint8_t ff_ia                      : 1;
    uint8_t wu_ia                      : 1;
    uint8_t single_tap                 : 1;
    uint8_t double_tap                 : 1;
    uint8_t _6d_ia                     : 1;
    uint8_t sleep_change_ia            : 1;
    uint8_t not_used_01                : 2;
} lis2dw12_all_int_src_t;

#define LIS2DW12_X_OFS_USR                   0x3CU
#define LIS2DW12_Y_OFS_USR                   0x3DU
#define LIS2DW12_Z_OFS_USR                   0x3EU
#define LIS2DW12_CTRL_REG7                   0x3FU
typedef struct {
    uint8_t lpass_on6d                 : 1;
    uint8_t hp_ref_mode                : 1;
    uint8_t usr_off_w                  : 1;
    uint8_t usr_off_on_wu              : 1;
    uint8_t usr_off_on_out             : 1;
    uint8_t interrupts_enable          : 1;
    uint8_t int2_on_int1               : 1;
    uint8_t drdy_pulsed                : 1;
} lis2dw12_ctrl_reg7_t;

/**
  * @defgroup LIS2DW12_Register_Union
  * @brief    This union group all the registers that has a bitfield
  *           description.
  *           This union is useful but not need by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union {
    lis2dw12_ctrl1_t                   ctrl1;
    lis2dw12_ctrl2_t                   ctrl2;
    lis2dw12_ctrl3_t                   ctrl3;
    lis2dw12_ctrl4_int1_pad_ctrl_t     ctrl4_int1_pad_ctrl;
    lis2dw12_ctrl5_int2_pad_ctrl_t     ctrl5_int2_pad_ctrl;
    lis2dw12_ctrl6_t                   ctrl6;
    lis2dw12_status_t                  status;
    lis2dw12_fifo_ctrl_t               fifo_ctrl;
    lis2dw12_fifo_samples_t            fifo_samples;
    lis2dw12_tap_ths_x_t               tap_ths_x;
    lis2dw12_tap_ths_y_t               tap_ths_y;
    lis2dw12_tap_ths_z_t               tap_ths_z;
    lis2dw12_int_dur_t                 int_dur;
    lis2dw12_wake_up_ths_t             wake_up_ths;
    lis2dw12_wake_up_dur_t             wake_up_dur;
    lis2dw12_free_fall_t               free_fall;
    lis2dw12_status_dup_t              status_dup;
    lis2dw12_wake_up_src_t             wake_up_src;
    lis2dw12_tap_src_t                 tap_src;
    lis2dw12_sixd_src_t                sixd_src;
    lis2dw12_all_int_src_t             all_int_src;
    lis2dw12_ctrl_reg7_t               ctrl_reg7;
    bitwise_t                          bitwise;
    uint8_t                            byte;
} lis2dw12_reg_t;

/**
  * @}
  *
  */

int32_t lis2dw12_read_reg(lis2dw12_ctx_t *ctx, uint8_t reg, uint8_t *data,
                          uint16_t len);
int32_t lis2dw12_write_reg(lis2dw12_ctx_t *ctx, uint8_t reg, uint8_t *data,
                           uint16_t len);

extern float lis2dw12_from_fs2_to_mg(int16_t lsb);
extern float lis2dw12_from_fs4_to_mg(int16_t lsb);
extern float lis2dw12_from_fs8_to_mg(int16_t lsb);
extern float lis2dw12_from_fs16_to_mg(int16_t lsb);
extern float lis2dw12_from_fs2_lp1_to_mg(int16_t lsb);
extern float lis2dw12_from_fs4_lp1_to_mg(int16_t lsb);
extern float lis2dw12_from_fs8_lp1_to_mg(int16_t lsb);
extern float lis2dw12_from_fs16_lp1_to_mg(int16_t lsb);
extern float lis2dw12_from_lsb_to_celsius(int16_t lsb);

typedef enum {
    LIS2DW12_HIGH_PERFORMANCE                    = 0x04,
    LIS2DW12_CONT_LOW_PWR_4                      = 0x03,
    LIS2DW12_CONT_LOW_PWR_3                      = 0x02,
    LIS2DW12_CONT_LOW_PWR_2                      = 0x01,
    LIS2DW12_CONT_LOW_PWR_12bit                  = 0x00,
    LIS2DW12_SINGLE_LOW_PWR_4                    = 0x0B,
    LIS2DW12_SINGLE_LOW_PWR_3                    = 0x0A,
    LIS2DW12_SINGLE_LOW_PWR_2                    = 0x09,
    LIS2DW12_SINGLE_LOW_PWR_12bit                = 0x08,
    LIS2DW12_HIGH_PERFORMANCE_LOW_NOISE          = 0x14,
    LIS2DW12_CONT_LOW_PWR_LOW_NOISE_4            = 0x13,
    LIS2DW12_CONT_LOW_PWR_LOW_NOISE_3            = 0x12,
    LIS2DW12_CONT_LOW_PWR_LOW_NOISE_2            = 0x11,
    LIS2DW12_CONT_LOW_PWR_LOW_NOISE_12bit        = 0x10,
    LIS2DW12_SINGLE_LOW_PWR_LOW_NOISE_4          = 0x1B,
    LIS2DW12_SINGLE_LOW_PWR_LOW_NOISE_3          = 0x1A,
    LIS2DW12_SINGLE_LOW_PWR_LOW_NOISE_2          = 0x19,
    LIS2DW12_SINGLE_LOW_LOW_NOISE_PWR_12bit      = 0x18,
} lis2dw12_mode_t;
int32_t lis2dw12_power_mode_set(lis2dw12_ctx_t *ctx, lis2dw12_mode_t val);
int32_t lis2dw12_power_mode_get(lis2dw12_ctx_t *ctx, lis2dw12_mode_t *val);

typedef enum {
    LIS2DW12_XL_ODR_OFF            = 0x00,
    LIS2DW12_XL_ODR_1Hz6_LP_ONLY   = 0x01,
    LIS2DW12_XL_ODR_12Hz5          = 0x02,
    LIS2DW12_XL_ODR_25Hz           = 0x03,
    LIS2DW12_XL_ODR_50Hz           = 0x04,
    LIS2DW12_XL_ODR_100Hz          = 0x05,
    LIS2DW12_XL_ODR_200Hz          = 0x06,
    LIS2DW12_XL_ODR_400Hz          = 0x07,
    LIS2DW12_XL_ODR_800Hz          = 0x08,
    LIS2DW12_XL_ODR_1k6Hz          = 0x09,
    LIS2DW12_XL_SET_SW_TRIG        = 0x10,  /* Use this only in SINGLE mode */
    LIS2DW12_XL_SET_PIN_TRIG       = 0x20,  /* Use this only in SINGLE mode */
} lis2dw12_odr_t;
int32_t lis2dw12_data_rate_set(lis2dw12_ctx_t *ctx, lis2dw12_odr_t val);
int32_t lis2dw12_data_rate_get(lis2dw12_ctx_t *ctx, lis2dw12_odr_t *val);

int32_t lis2dw12_block_data_update_set(lis2dw12_ctx_t *ctx, uint8_t val);
int32_t lis2dw12_block_data_update_get(lis2dw12_ctx_t *ctx, uint8_t *val);

typedef enum {
    LIS2DW12_2g     = 0,
    LIS2DW12_4g     = 1,
    LIS2DW12_8g     = 2,
    LIS2DW12_16g    = 3,
} lis2dw12_fs_t;
int32_t lis2dw12_full_scale_set(lis2dw12_ctx_t *ctx, lis2dw12_fs_t val);
int32_t lis2dw12_full_scale_get(lis2dw12_ctx_t *ctx, lis2dw12_fs_t *val);

int32_t lis2dw12_status_reg_get(lis2dw12_ctx_t *ctx, lis2dw12_status_t *val);

int32_t lis2dw12_flag_data_ready_get(lis2dw12_ctx_t *ctx, uint8_t *val);

typedef struct {
    lis2dw12_status_dup_t   status_dup;
    lis2dw12_wake_up_src_t  wake_up_src;
    lis2dw12_tap_src_t      tap_src;
    lis2dw12_sixd_src_t     sixd_src;
    lis2dw12_all_int_src_t  all_int_src;
} lis2dw12_all_sources_t;
